ai_org/public_html/courses/fast_ai_dl_course/lesson2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-01-31 Wed 09:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Monib Ahmed" />
</head>
<body>
<div id="content">
<div id="outline-container-orgee132c8" class="outline-2">
<h2 id="orgee132c8"><span class="section-number-2">1</span> Fast AI Lesson 2</h2>
<div class="outline-text-2" id="text-1">
<p>
Progressive Growing of GANs for Improved Quality, Stability, and Variation
<a href="https://arxiv.org/abs/1710.10196">https://arxiv.org/abs/1710.10196</a>
</p>

<p>
Snapshot Ensembles: Train 1, get M for free
<a href="https://arxiv.org/abs/1704.00109">https://arxiv.org/abs/1704.00109</a>
</p>
</div>
</div>

<div id="outline-container-orgba22616" class="outline-2">
<h2 id="orgba22616"><span class="section-number-2">2</span> Gradients</h2>
</div>
<div id="outline-container-org59ba23a" class="outline-2">
<h2 id="org59ba23a"><span class="section-number-2">3</span> Learning Finder</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgbafebe5" class="outline-3">
<h3 id="orgbafebe5"><span class="section-number-3">3.1</span> Learning rate vs loss</h3>
</div>
<div id="outline-container-orgda0616e" class="outline-3">
<h3 id="orgda0616e"><span class="section-number-3">3.2</span> Want highest learning rate without being flat.</h3>
</div>
<div id="outline-container-org9af212e" class="outline-3">
<h3 id="org9af212e"><span class="section-number-3">3.3</span> Improving learning using other momentums</h3>
</div>
</div>
<div id="outline-container-orgbf55adf" class="outline-2">
<h2 id="orgbf55adf"><span class="section-number-2">4</span> Hyperparameters</h2>
</div>
<div id="outline-container-org013d211" class="outline-2">
<h2 id="org013d211"><span class="section-number-2">5</span> Give it more data &#x2013; overfitting</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org01fb983" class="outline-3">
<h3 id="org01fb983"><span class="section-number-3">5.1</span> Data augmentation</h3>
<div class="outline-text-3" id="text-5-1">
</div>
<div id="outline-container-org86a8fce" class="outline-4">
<h4 id="org86a8fce"><span class="section-number-4">5.1.1</span> Make a decision with what makes sense</h4>
</div>
<div id="outline-container-org6fbfd29" class="outline-4">
<h4 id="org6fbfd29"><span class="section-number-4">5.1.2</span> Move, zoom, rotate, flip</h4>
</div>
<div id="outline-container-org49ef7a9" class="outline-4">
<h4 id="org49ef7a9"><span class="section-number-4">5.1.3</span> Learn from different angles</h4>
</div>
<div id="outline-container-org1825bfe" class="outline-4">
<h4 id="org1825bfe"><span class="section-number-4">5.1.4</span> learn.precompute=True/False ???</h4>
</div>
<div id="outline-container-orge61f4e4" class="outline-4">
<h4 id="orge61f4e4"><span class="section-number-4">5.1.5</span> cycle<sub>len</sub> = 1, SDG with restarts, learning rate annealing (cosine)</h4>
</div>
<div id="outline-container-org63c0265" class="outline-4">
<h4 id="org63c0265"><span class="section-number-4">5.1.6</span> "jump up" the learning rate to get flatter minimum.</h4>
</div>
<div id="outline-container-org09e85ad" class="outline-4">
<h4 id="org09e85ad"><span class="section-number-4">5.1.7</span> TTA - Test time augmentation</h4>
</div>
</div>
</div>
<div id="outline-container-org88ccd1f" class="outline-2">
<h2 id="org88ccd1f"><span class="section-number-2">6</span> Finetuning, unfreeze (does not recompute)</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org27ead7e" class="outline-3">
<h3 id="org27ead7e"><span class="section-number-3">6.1</span> Differential learning rates</h3>
</div>
</div>
<div id="outline-container-org1a7149b" class="outline-2">
<h2 id="org1a7149b"><span class="section-number-2">7</span> Confusion Matrix</h2>
</div>
<div id="outline-container-org55665dd" class="outline-2">
<h2 id="org55665dd"><span class="section-number-2">8</span> Batchsize</h2>
</div>
<div id="outline-container-orgb6c58c9" class="outline-2">
<h2 id="orgb6c58c9"><span class="section-number-2">9</span> Change architecture (resnext50)</h2>
</div>

<div id="outline-container-orgacbac7f" class="outline-2">
<h2 id="orgacbac7f"><span class="section-number-2">10</span> Homework</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org0a62aed" class="outline-3">
<h3 id="org0a62aed"><span class="section-number-3">10.1</span> <span class="todo TODO">TODO</span> Learnng rates vs Cycle etc</h3>
</div>
<div id="outline-container-orgeff6646" class="outline-3">
<h3 id="orgeff6646"><span class="section-number-3">10.2</span> <span class="todo TODO">TODO</span> Dog breed Kaggle Competition (CSV File has targets)</h3>
</div>
<div id="outline-container-orgdfaf3fe" class="outline-3">
<h3 id="orgdfaf3fe"><span class="section-number-3">10.3</span> <span class="todo TODO">TODO</span> How many signficant figures are needed (how does this relate to log scale)</h3>
</div>
<div id="outline-container-org4a566f2" class="outline-3">
<h3 id="org4a566f2"><span class="section-number-3">10.4</span> <span class="todo TODO">TODO</span> Kaggle CLI to get data and submit results</h3>
</div>
<div id="outline-container-org16b2bb9" class="outline-3">
<h3 id="org16b2bb9"><span class="section-number-3">10.5</span> <span class="todo TODO">TODO</span> AWS Setup on your own account (fastai, p2xlarge)</h3>
</div>
</div>

<div id="outline-container-org69483b4" class="outline-2">
<h2 id="org69483b4"><span class="section-number-2">11</span> Kaggle Competitions to try</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-org6920b59" class="outline-3">
<h3 id="org6920b59"><span class="section-number-3">11.1</span> <span class="todo TODO">TODO</span> House Prices : <a href="https://www.kaggle.com/c/house-prices-advanced-regression-techniques/leaderboard">https://www.kaggle.com/c/house-prices-advanced-regression-techniques/leaderboard</a></h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Monib Ahmed</p>
<p class="date">Created: 2018-01-31 Wed 09:35</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
